src/BusinessProcesses/ФормированиеЗаявки/ФормированиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ФормированиеЗаявки</name>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <comment>Результат выполнения задания после завершения бизнес-процесса.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <comment>Фактическая дата завершения бизнес-процесса</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Описание задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПроверке</name>
    <comment>Признак того, что указан проверяющий по задаче</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИтерации</name>
    <comment>Количество циклов бизнес-процесса между исполнителем и проверяющим</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждено</name>
    <comment>Внутреннее состояние бизнес-процесса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <comment>Объект системы, &quot;по поводу&quot; которого был создан бизнес-процесс.</comment>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>История переписки исполнителя и проверяющего</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнееЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаИсточник</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПредмета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресацииПроверяющий</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресацииПроверяющий</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадачПроверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/Enums/ТипыКонтрактов/ТипыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрактов</name>
  <enumValues>
    <name>Контракт</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>ТКП</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыКонтрактов/ВидыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрактов</name>
  <enumValues>
    <name>КонтрактСЗаказчиком</name>
  </enumValues>
  <enumValues>
    <name>КонтрактСПоставщиком</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/BusinessProcesses/ФормированиеЗаявки/Forms/ФормаЗадач/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Для нового объекта выполняем код инициализации формы в ПриСозданииНаСервере.
	// Для существующего - в ПриЧтенииНаСервере.
	Если Объект.Ссылка.Пустая() Тогда
		ИнициализацияФормы();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	АвторСтрокой = Строка(Объект.Автор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокКонтрактов, "Заявка", Объект.Предмет, Истина);
	
	Если ЗначениеЗаполнено(Объект.ОсновнойОбъектАдресации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКонтрактов, "Контрагент", Объект.ОсновнойОбъектАдресации, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	БизнесПроцессыИЗадачиКлиент.ФормаЗадачиОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОткрытьФормуЗадачиНажатие(Элемент)
	
	ПоказатьЗначение(,Объект.Ссылка);
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.Предмет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИсполненияПриИзменении(Элемент)
	
	Если Объект.ДатаИсполнения = НачалоДня(Объект.ДатаИсполнения) Тогда
		Объект.ДатаИсполнения = КонецДня(Объект.ДатаИсполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить(Команда)
	
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненаВыполнить(Команда)

	Если НЕ ПроверитьВыполнениеЗадачи() Тогда
		Возврат;
	КонецЕсли;
	
	Выполнена = БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтотОбъект, Истина);
	
	Если Выполнена Тогда 
		УстановитьСледующийЭтапВыполненияЗаявки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Дополнительно(Команда)
	
	БизнесПроцессыИЗадачиКлиент.ОткрытьДопИнформациюОЗадаче(Объект.Ссылка);
	
КонецПроцедуры

#Область РаботаСКоммерческимиПредложениями

&НаКлиенте
Процедура ОткрытьФормированиеЗаявокНаКП(Команда)
	
	ПараметрыОткрытияОбработки = Новый Структура;
	Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.Заявка") Тогда
		ПараметрыОткрытияОбработки.Вставить("Заявка", Объект.Предмет);
	ИначеЕсли ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.ЗапросТКПRFP") Тогда
		ПараметрыОткрытияОбработки.Вставить("ЗапросТКПRFP", Объект.Предмет);
	КонецЕсли;
		
	ОткрытьФорму("Обработка.ФормированиеЗаявокНаКомерческиеПредложения.Форма.Форма", 
		ПараметрыОткрытияОбработки);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуЗапросаКП(Команда)
	
	ПараметрыОткрытияОбработки = Новый Структура;
	Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.Заявка") Тогда
		ПараметрыОткрытияОбработки.Вставить("Заявка", Объект.Предмет);
	ИначеЕсли ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.ЗапросТКПRFP") Тогда
		ПараметрыОткрытияОбработки.Вставить("ЗапросТКПRFP", Объект.Предмет);
	КонецЕсли;

	ОткрытьФорму("Обработка.ОбработкаЗапросаКоммерческогоПредложения.Форма.Форма", 
		ПараметрыОткрытияОбработки);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияФормы()
	
	Если ЗначениеЗаполнено(Объект.БизнесПроцесс) Тогда
		ПараметрыФормы = БизнесПроцессыИЗадачиВызовСервера.ФормаВыполненияЗадачи(Объект.Ссылка);
		ЕстьФормаЗадачи = ПараметрыФормы.Свойство("ИмяФормы");
		Элементы.Выполнена.Доступность = НЕ ЕстьФормаЗадачи;
	КонецЕсли;
	НачальныйПризнакВыполнения = Объект.Выполнена;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
		Объект.СрокИсполнения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Элементы.Предмет.Гиперссылка = Объект.Предмет <> Неопределено И НЕ Объект.Предмет.Пустая();
	ПредметСтрокой = ОбщегоНазначения.ПредметСтрокой(Объект.Предмет);	
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.СрокНачалаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	Элементы.ДатаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	БизнесПроцессыИЗадачиСервер.УстановитьФорматДаты(Элементы.СрокИсполнения);
	БизнесПроцессыИЗадачиСервер.УстановитьФорматДаты(Элементы.Дата);
	
	БизнесПроцессыИЗадачиСервер.ФормаЗадачиПриСозданииНаСервере(ЭтотОбъект, Объект, 
		Элементы.ГруппаСостояние, Элементы.ДатаИсполнения);
		
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Элементы.Автор.Видимость = Ложь;
		Элементы.АвторСтрокой.Видимость = Истина;
		Элементы.Исполнитель.КнопкаОткрытия = Ложь;
	КонецЕсли;
	
	Элементы.Выполнена.Доступность = ПравоДоступа("Изменение", Метаданные.Задачи.ЗадачаИсполнителя);
	
	Если Объект.РольИсполнителя.Пустая() Тогда
		Элементы.РольИсполнителя.Видимость = Ложь;
		Элементы.Исполнитель.Видимость = Истина;
	Иначе
		Элементы.РольИсполнителя.Видимость = Истина;
		Элементы.Исполнитель.Видимость = Ложь;
	КонецЕсли;
	
	// + 27.02.2018 14:11:26 Базунов Д.А. Задача: 
	
	Точки = БизнесПроцессы.ФормированиеЗаявки.ТочкиМаршрута;
	
	Если Объект.ТочкаМаршрута = Точки.ПодготовкаКП ИЛИ 
		Объект.ТочкаМаршрута = Точки.ФормированиеТКПСЗаказчиком ИЛИ
		Объект.ТочкаМаршрута = Точки.ФормированиеПроектаКонтрактаНаПоставкуПС Тогда
		Элементы.ГруппаСписокКонтрактов.Видимость = Истина;
	ИначеЕсли Объект.ТочкаМаршрута = Точки.АкцептованиеДЗО Тогда
		Элементы.ГруппаСписокКонтрактов.Видимость = Истина;
		Элементы.СписокКонтрактовСоздатьКП.Видимость = Ложь;
	КонецЕсли; 
	
	//Тип	Равно	Перечисление.ТипыКонтрактов.КоммерческоеПредложение	
	//Вид	Равно	Перечисление.ВидыКонтрактов.КонтрактСПоставщиком	
	
	Если Объект.ТочкаМаршрута = Точки.ФормированиеТКПСЗаказчиком Тогда
		
		Элементы.СписокКонтрактовСоздатьКП.Заголовок = "Создать ТКП";
		
		СписокОтборов = СписокКонтрактов.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		СписокОтборов.Очистить();
		НовОтбор = СписокОтборов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Тип");
		НовОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		НовОтбор.ПравоеЗначение = Перечисления.ТипыКонтрактов.ТКП;
		НовОтбор.Использование = Истина;
		НовОтбор = СписокОтборов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид");
		НовОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		НовОтбор.ПравоеЗначение = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком;
		НовОтбор.Использование = Истина;
		
	ИначеЕсли Объект.ТочкаМаршрута = Точки.ФормированиеПроектаКонтрактаНаПоставкуПС Тогда
		
		Элементы.СписокКонтрактовСоздатьКП.Заголовок = "Создать контракт";
		СписокОтборов = СписокКонтрактов.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		СписокОтборов.Очистить();
		НовОтбор = СписокОтборов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Тип");
		НовОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		НовОтбор.ПравоеЗначение = Перечисления.ТипыКонтрактов.Контракт;
		НовОтбор.Использование = Истина;
		НовОтбор = СписокОтборов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид");
		НовОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		НовОтбор.ПравоеЗначение = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком;
		НовОтбор.Использование = Истина;
		
	КонецЕсли; 
	
	Элементы.ФормаГруппаОбработокКП.Видимость = ((Объект.ТочкаМаршрута = Точки.ОпределениеОтветственногоДЗО) ИЛИ (Объект.ТочкаМаршрута = Точки.ПодготовкаКП));
	
	Если ТолькоПросмотр Тогда
		Элементы.Выполнена.Доступность = Ложь;
	КонецЕсли; 
	
	// - 27.02.2018 14:11:26 Базунов Д.А. Задача:
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если СокрЛП(Объект.РезультатВыполнения) = "" Тогда
		Если Объект.ВыбранныйВариант = "" Тогда
			Объект.РезультатВыполнения = "Выполнена";
		Иначе
			Объект.РезультатВыполнения = СокрЛП(Объект.ВыбранныйВариант);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// + 27.02.2018 11:44:32 Базунов Д.А. Задача: 

&НаСервере
Функция ПроверитьВыполнениеЗадачи()
	
	Точки = БизнесПроцессы.ФормированиеЗаявки.ТочкиМаршрута;
	
	Если Объект.ТочкаМаршрута = Точки.ОпределениеОтветственногоДЗО Тогда
		
		// Проверка что все исполнители ДЗО заполнены
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСпецификация.ИсполнительДЗО КАК ИсполнительДЗО
		|ИЗ
		|	Документ.Заявка.Спецификация КАК ЗаявкаСпецификация
		|ГДЕ
		|	ЗаявкаСпецификация.Ссылка = &Ссылка
		|	И ЗаявкаСпецификация.ИсполнительДЗО = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Предмет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Сообщить("В заявке не указаны Исполнители ДЗО!");
			Возврат Ложь;
		КонецЕсли; 
		
	ИначеЕсли Объект.ТочкаМаршрута = Точки.АкцептованиеДЗО Тогда
		
		Ошибка = Ложь;
		ЗапросТКП = Объект.Предмет.ЗапросТКПRFP;
		Если Объект.Предмет.СпециалистДЭ.Пустая() Тогда
			Сообщить("В заявке не указан специалист департамента экономики!");
			Ошибка = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЗапросТКП.НомерФСВТС) Тогда
			Сообщить("В запросе не указан Номер ФС ВТС!");
			Ошибка = Истина;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ЗапросТКП.ДатаРегистрацииФСВТС) Тогда
			Сообщить("В запросе не указана Дата регистрации ФС ВТС!");
			Ошибка = Истина;
		КонецЕсли; 
		Если Ошибка Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ДобавитьЭтапВЗаявку(Этап = Неопределено)
	
	Если Этап = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Возврат ОбщиеФункцииСервер.ДобавитьЭтапКЗаявке(Объект.Предмет, Этап, ТекущаяДата());
	
КонецФункции
 
&НаСервере
Функция УстановитьСледующийЭтапВыполненияЗаявки()
	
	Точки = БизнесПроцессы.ФормированиеЗаявки.ТочкиМаршрута;
	
	Если Объект.ТочкаМаршрута = Точки.ОпределениеОтветственногоДЗО Тогда
		
		ДобавитьЭтапВЗаявку(Константы.ЭтапЗаявкиОпределениеОтветственногоДЗО.Получить());
		
	ИначеЕсли Объект.ТочкаМаршрута = Точки.АкцептованиеДЗО Тогда
		
		ДобавитьЭтапВЗаявку(Константы.ЭтапЗаявкиАкцептованиеДЗО.Получить());
		
	ИначеЕсли Объект.ТочкаМаршрута = Точки.ФормированиеПредварительныхВнешнихЦен Тогда
		
		ДобавитьЭтапВЗаявку(Константы.ЭтапЗаявкиФормированиеПредварительныхВнешнихЦен.Получить());
		
	ИначеЕсли Объект.ТочкаМаршрута = Точки.КорректировкаВнешнихЦен Тогда
		
		ДобавитьЭтапВЗаявку(Константы.ЭтапЗаявкиКорректировкаВнешнихЦен.Получить());
		
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ВернутьТипСозданияКонтракта()
	
	Точки = БизнесПроцессы.ФормированиеЗаявки.ТочкиМаршрута;
	
	Если Объект.ТочкаМаршрута = Точки.ПодготовкаКП Тогда 
		Возврат "ТКПСПоставщиком";
	ИначеЕсли Объект.ТочкаМаршрута = Точки.ФормированиеТКПСЗаказчиком Тогда
		Возврат "ТКПСЗаказчиком";
	ИначеЕсли Объект.ТочкаМаршрута = Точки.ФормированиеПроектаКонтрактаНаПоставкуПС Тогда
		Возврат "КонтрактСЗаказчиком";
	КонецЕсли;
	
КонецФункции
 
&НаКлиенте
Процедура СоздатьКП(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить(ВернутьТипСозданияКонтракта());
	ПараметрыОткрытия.Вставить("ЗаявкаСсылка", Объект.Предмет);
	// ++ 09.07.2018 15:56:54 Базунов Д.А. Задача: 
	Если ЗначениеЗаполнено(Объект.ОсновнойОбъектАдресации) Тогда
		Массив = Новый Массив();
		Массив.Добавить(Объект.ОсновнойОбъектАдресации);
		ПараметрыОткрытия.Вставить("ИсполнительДЗО", Массив);
	КонецЕсли; 
	// -- 09.07.2018 15:56:54 Базунов Д.А. Задача:
	
	ОткрытьПодборПозицийЗаявок(ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПозицийЗаявок(ПараметрыОткрытия)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикПодбораПозицийЗаявок", Этотобъект, ПараметрыОткрытия);
	
	ОткрытьФорму("Документ.Контракт.Форма.ФормаПодбораПозицийЗаявок", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	

КонецПроцедуры // ОткрытьПодборПозицийЗаявок()

&НаКлиенте
Процедура ОбработчикПодбораПозицийЗаявок(АдресВременногоХранилища, ДопПараметры) Экспорт

	Если Не АдресВременногоХранилища = Неопределено Тогда
		
		ДопПараметры.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
		Если ДопПараметры.Свойство("ТКПСПоставщиком") Тогда
			ДопПараметры.Вставить("ВидКонтракта", ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСПоставщиком"));
			ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСПоставщиком", ДопПараметры);
		Иначе
			ДопПараметры.Вставить("ВидКонтракта", ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСЗаказчиком"));
			ОткрытьФорму("Документ.Контракт.Форма.ФормаКонтрактаСЗаказчиком", ДопПараметры);
		КонецЕсли; 
		
	КонецЕсли;	

КонецПроцедуры // ОбработчикПодбораПозицийЗаявок()


// - 27.02.2018 11:44:32 Базунов Д.А. Задача:

#КонецОбласти
